void main() {
// while
  // var num = 5;
  // var i = 1;
  // while (i < 11) {
  //   //  if (i == 5)
  //   // i++;
  //   // continue; пропускает цикл, когда i дойдёт до 5

  //   // break; - получаем таблицу до 4х, потому как когда i будет равен 5 - цикл прервётся
  //   print('$num x $i = ${num * i}');
  //   i++;
  // }

// do...while
  // var num = 5;
  // var i = 1;
  // do {
  //   print('$num x $i = ${num * i}');
  //   i++;
  // } while (i < 11);

  // .split(''); -- Разделяет строку на элементы и создаёт строку из этих элементов
  // .isEven -- Проверяет на чётность
}
